app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails"], ["room_number", "25"], ["created_at", "2019-07-22 00:54:07.492324"], ["updated_at", "2019-07-22 00:54:07.492324"]]
---
	def create
		@s = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", "10"], ["updated_at", "2019-07-22 01:15:36.896685"], ["id", 1]]
---
	def update
		@school_class = SchoolClass.find(params[:id])
		@school_class.update(params.require(:school_class).permit(:title, :room_number))