app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Varvara"], ["last_name", "Babkova"], ["created_at", "2019-07-22 01:07:32.595678"], ["updated_at", "2019-07-22 01:07:32.595678"]]
---
	def create
		@s = Student.create(params.require(:student).permit(:first_name, :last_name))